In [1]:
import pandas as pd 
import numpy as np

In [3]:
df=pd.read_csv(r"C:\Users\admin\Desktop\Restaurant.csv")
df.head(3)

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,1,McDonald's,NaN,40412,4.9%,13846,-0.5%,NaN,Quick Service & Burger
1,2,Starbucks,NaN,21380,8.6%,15049,3.0%,NaN,Quick Service & Coffee Cafe
2,3,Chick-fil-A,While Popeyes got a lot of the chicken buzz in...,11320,13.0%,2470,5.0%,NaN,Quick Service & Chicken

In [5]:
df.shape

(250, 9)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              250 non-null    int64
 1   Restaurant        250 non-null    object
 2   Content           33 non-null     object
 3   Sales             250 non-null    int64
 4   YOY_Sales         250 non-null    object
 5   Units             250 non-null    int64
 6   YOY_Units         250 non-null    object
 7   Headquarters      52 non-null     object
 8   Segment_Category  250 non-null    object
dtypes: int64(3), object(6)
memory usage: 17.7+ KB

In [7]:
df.describe()

             Rank        Sales         Units
count  250.000000    250.00000    250.000000
mean   125.500000   1242.74000    850.076000
std     72.312977   3365.22882   2296.151659
min      1.000000    126.00000     13.000000
25%     63.250000    181.00000     85.000000
50%    125.500000    330.00000    207.000000
75%    187.750000    724.75000    555.250000
max    250.000000  40412.00000  23801.000000

In [8]:
df.size

2250

### Finding Total Null Values

In [11]:
df.isnull().head(5)

,Rank,Restaurant,Content,Sales,YOY_Sales,Units,YOY_Units,Headquarters,Segment_Category
0,False,False,True,False,False,False,False,True,False
1,False,False,True,False,False,False,False,True,False
2,False,False,False,False,False,False,False,True,False
3,False,False,True,False,False,False,False,True,False
4,False,False,True,False,False,False,False,True,False

In [12]:
df.isnull().sum()

Rank                  0
Restaurant            0
Content             217
Sales                 0
YOY_Sales             0
Units                 0
YOY_Units             0
Headquarters        198
Segment_Category      0
dtype: int64

In [14]:
df.isnull().sum().sum() #Finding Total Null Values

415

### Dropping the Row having Null Values

In [16]:
#axis=1 for cols default is 0
df2=df.dropna()
df2.shape

(1, 9)

In [17]:
df3=df.dropna(how="all") #if all row ka value is null then only drop row
df3.shape

(250, 9)

### Dropping columns having Null Values

In [20]:
df4=df.dropna(how="any",axis=1) #Column is been Dropped
df4.shape

(250, 7)

In [21]:
df.dropna(inplace=True) #original dataframe will be lost and will be replaced with this new daraframe

In [23]:
df.shape

(1, 9)